# GetOriginalMemberIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinearArray..::..GetOriginalMemberIds Method
LinearArray Class See Also
---
Retrieves the original member Ids of the Array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public override ICollection<ElementId> GetOriginalMemberIds()
```

Visual Basic
---
```text
Public Overrides Function GetOriginalMemberIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
virtual ICollection<ElementId^>^ GetOriginalMemberIds() override
```

# ### Return Value
The original member Ids of the Array
# See Also
LinearArray Class
Autodesk.Revit.DB Namespace